#หา array2 มิติ ที่เอามาบวกกันในแนวทแยงมุม
"""
    {ดราฟงาน}
    box = [ 1 , 2 , 3
            4 , 5 , 6 
            7 , 8 , 9]

    (1 + 5 + 9) + (3 + 5 + 7) = ?
    (0.0,1.1,2.2) + (0.2,1.1,2.0)
"""
#ประกาศตัวแปร
sum1 = 0
sum2 = 0
box = [[1,2,3],[4,5,6],[7,8,9]] 

for i in range(len(box)): #ให้loopวิ่งเท่าจำนวนขนาดของarrayโดยใช้len
    sum1 += box[i][i]  # ให้sum1บวก1ใส่arrayทุกรอบที่วิ่งผ่าน
    sum2 += box[i][(len(box)-1)-i] # ให้sum2บวก1ใส่box[i]ที่เอาจำนวนขนาดของarray(เท่ากับ3ตลอด)แล้วเอาไปลบ1แล้วลบอีกทีด้วยจำนวนรอบ(i)

print(sum1 - sum2) # เอา sum1 - sum2 แล้วแสดงผลออกมา
