#progamนี้ทำขึ้นมาเพื่อสุ่มหรือสร้างpyramidออกมาเป็นเลขคี่
import random

def rando():#สุ่มตัวเลขออกมาแล้งเก็บค่าไว้
    print("1. generate เลขคี่ใน 1-100")
    x = random.randint(0, 100)#สุ่มตัวเลขแทนตัวเลขที่สุ่มได้เป็นx
    print("ran" , x)#เช็ควาได้ตัวเลขที่สุ่มได้มีค่าเท่าไหร
    if x % 2 == 0:#เข่้าifเช็คว่าตัวเลขเป็นเลขคู่หรือเลขคี่ถ้าเป็นเลขคี่ให้ข้ามขั้นตอนนี่
        x = x + 1#นำเลขคี่ที่สุ่มได้มา+1เพื่อให้เป็นเลขคู่
        show(x)#ส่งค่าที่ได้ไปshow
        return x#ส่งข้อมูลที่ได้กลับคืน

    show(x)#ถ้าสุ่มได้เป็นเลขคี่ให้ส่งค่าไปshowเพื่อแสดงค่า

def iup():#หัวข้อนี้เพท่อใช้รับค่าที่userส่งมา
    pc = int(input("plz enter ur odd num :"))#ใส่inputที่เป็นintแทนค่าด้วยpc
    if pc % 2 == 0:#ถ้าuserใส่ค่าเป็นเลขคี่ให้เข้าหัวข้อนี้
        print(pc+1)#ให้printค่าที่userมาเพื่อ+1ให้กลายเป็นเลขคี่
        pyramid(pc)#ส่งค่าที่ได้จาการ+1ไปที่pyramidเพื่อทำงานต่อไป
    else:#ถ้าuserใส่ค่าเป็นเลขคู่ให้เข้าหัวข้อนี้
        pyramid(pc)#ส่งค่าที่ได้จาการรับค่าไปที่pyramidเพื่อทำงานต่อไป


def pyramid(x):#เอาค่าที่ได้จากส่วนต่างๆมาprintเป็นpyramid
    for i in range(x):#forloopนี้เพื่อให้*ครบตามจำนวนที่userใส่แทนด้วยx
        for j in range(1, (2 * i)):#forloopนี้เพื่อให้*printออกมาเป็นเลขคี่เท่านั้นโดยอยู่ใต้forloopที่แล้วเพื่อให้ครบตามจำนวนโดยการที่ทำให้เป็นเลขคี่ได้โดยนำ1เอาไป+กับ2ที่คูณด้วยจำนวนรอบที่ได้
            print("*", end=" ")#เพื่อกำหนดว่าให้ระบบprintเป็น"*"แล้วให้้จบบรรทัด
        print("\n")#เพื่อให้เว้นวรรคระหว่างpyramid
    show(x)#ส่งที่ได้เ่ให้ส่งค่าไปshowเพื่อแสดงค่า

def show(xp):#หัวข้อน้ีมีเพื่อแสดงข้อมูลทุกอย่างให้userเห็น
    print("this xp" ,str(xp))#printค่าทุกๆอย่างและเช็คว่าเลขที่ได้มานั้นมีค่าเท่าไหร


def main():#หัวข้อนี่เป็นหัวข้อหลักเพื่อให้userใส้ทางเลือก

    while(1):#ทำให้ระบบวนซ่ำเพื่อไม่ให้เลขที่randomออกมาได้หาย
            print("1. generate เลขคี่ใน 1-100")
            print("2. print * จากการสุ่มเลขคี่ที่ได้ โดยปริ้นเป็นเลขคี่เท่านั้น เช่น แถวที่ 1 ปริ้น * แถวที่ 2 ปริ้น *** ")
            print("3. print * จากการรับค่าทางคีย์บอร์ดที่เป็นเลขคี่ โดยปริ้นเป็นเลขคี่เท่านั้น เช่น แถวที่ 1 ปริ้น * แถวที่ 2 ปริ้น *** ")
            case = (int(input("pick one :")))#เพื่อให้userเลือกว่าอยากได้หัวข้ออะไร
            if case == 1:#ถ้าuserพิมพ์1ให้มาที่หัวข้อนี้
                y = rando()#ส่งค่าyไปที่หัวข้อrandoเพื่อไปrandomออกมา
            elif case == 2:#้ถ้าuserพิมพ์2ให้มาที่หัวข้อนี้
                pyramid(int(y))#ให้ส่งค่าyที่ได้จากข้อที่1เป็นintแทนด้วยy
            elif case == 3:#้ถ้าuserพิมพ์3ให้มาที่หัวข้อนี้
                iup()#ส่งค่าไปในหัวข้อiupเพื่อไปinputค่า

if __name__ == '__main__' :#ถ้าชื่อของหัวข้อคือmainให้เข้าหัวข้อนี้
    main()#print หัวข้อmain
